[{"pageContent":"Transform Your Plaza. Get a Quote Get Inspired Driveway Patio Plaza Garden Pool Deck Our concrete pavers can turn your outdoor walkway, deck, patio, or plaza into a functional work of art. Colonial Classic Starting at $202.99 per sqft Learn More Banjo Starting at $218.99 per sqft Learn More Heritage Series Starting at $218.99 per sqft Learn More Cobble Mix Starting at $218.99 per sqft Learn More Old World Cobble Starting at $202.99 per sqft Learn More View Product Catalogue Inspiration Don't know where to start? Look at our best projects. Get Inspired Our Locations Where to buy. We operate from two locations, namely, our manufacturing plant in Yallahs, St Thomas and our main office and showroom at 27 Mannings Hill Road, Kingston. Get a Quote  Find an Installer Installation Video About Us Millennium Paving Stones LTD. Millennium Paving Stones Limited is the largest manufacturer of paving stones in Jamaica, and has been in operation since 2000. We also manufacture stepping stones, grasscrete, curb wall and distribute such complementary products as sealers, cleaners and polymeric sand. Explore Products Get a Quote","metadata":{"source":"https://beta.millpave.notprimitive.com/","title":"Millennium Paving Stones","contentLength":187}},{"pageContent":"Get in touch. Contact Form Submit Millennium Locations R Retail M Manufacturing Kingston, JA R Shop 1, 27 Mannings Hill Road Kingston 8 Phone: 876-969-1716 / 876-969-7385 Cell: 876-361-2817 Fax: 876-931-9651 St. Thomas, JA M Shop 1, 27 Mannings Hill Road Kingston 8 Phone: 876-703-3151 Fax: 876-706-3284","metadata":{"source":"https://beta.millpave.notprimitive.com/contact","title":"Contact","contentLength":58}},{"pageContent":"Product Name: Banjo. The price of Banjo ranges from $219 to $396. Banjo description: Create a traditional feel to your garden with our Banjo Paver. As one of the most sought after styles of stone paving, it displays a beautiful range of colors which will brighten up any exterior to create an added sense of space! Using aggregates sourced from the St. Thomas River, Banjo promises an outdoor area filled with character and is a household favourite providing a wealth of design opportunities. Banjo specifications by variant group: \"Banjo\": Dimensions -- 5.5in x 9in x 2.375in, Weight per Unit -- 6.67, Area per Pallet -- 128.57, Units per Pallet -- 450, Pieces per sqft -- 3.5. Banjo is similar to Colonial Classic, Heritage Series, and Cobble Mix. 3D virtual samples of Banjo are available. The following are the prices for all variants of Banjo: Banjo Ash costs $247 per sqft and $70.57 per unit. Banjo Charcoal costs $247 per sqft and $70.57 per unit. Banjo Charcoal Red costs $247 per sqft and $70.57 per unit. Banjo Green costs $396 per sqft and $113.14 per unit. Banjo Grey costs $219 per sqft and $62.57 per unit. Banjo Orange costs $247 per sqft and $70.57 per unit. Banjo Red costs $247 per sqft and $70.57 per unit. Banjo Red Yellow costs $247 per sqft and $70.57 per unit. Banjo Shale Brown costs $247 per sqft and $70.57 per unit. Banjo Slate costs $247 per sqft and $70.57 per unit. Banjo Spanish Brown costs $247 per sqft and $70.57 per unit. Banjo Sunset Clay costs $247 per sqft and $70.57 per unit. Banjo Sunset Tangerine costs $247 per sqft and $70.57 per unit. Banjo Sunset Taupe costs $247 per sqft and $70.57 per unit. Banjo Tan costs $247 per sqft and $70.57 per unit. Banjo Terracotta costs $247 per sqft and $70.57 per unit. Banjo Yellow costs $253 per sqft and $72.29 per unit.","metadata":{"title":"Banjo","source":"https://millpave.notprimitive.com/product/banjo","contentLength":338}},{"pageContent":"Product Name: Circle Bundle. The price of Circle Bundle ranges from $228.5 to $445.5. Circle Bundle description: Create a traditional feel to your garden with our Circle Bundle Paver. As one of the most sought after styles of stone paving, it displays a beautiful range of colors which will brighten up any exterior to create an added sense of space! Using aggregates sourced from the St. Thomas River, Circle Bundle promises an outdoor area filled with character and is a household favourite providing a wealth of design opportunities. Circle Bundle specifications by variant group: \"Circle Bundle\": Weight per Unit -- 2.75, Area per 8ft bundle -- 63, Area per 5ft bundle -- 31.5, Units per 8ft bundle -- 419, Units per 5ft bundle -- 169. Circle Bundle is similar to Old World Cobble, Cobble Mix, and Colonial Classic. Circle Bundle does not have 3D virtual samples at the moment. The following are the prices for all variants of Circle Bundle: Circle Bundle Ash costs $267.5 per sqft. Circle Bundle Charcoal costs $267.5 per sqft. Circle Bundle Charcoal Red costs $267.5 per sqft. Circle Bundle Green costs $445.5 per sqft. Circle Bundle Grey costs $228.5 per sqft. Circle Bundle Orange costs $267.5 per sqft. Circle Bundle Red costs $267.5 per sqft. Circle Bundle Red Yellow costs $267.5 per sqft. Circle Bundle Shale Brown costs $267.5 per sqft. Circle Bundle Slate costs $267.5 per sqft. Circle Bundle Spanish Brown costs $267.5 per sqft. Circle Bundle Sunset Clay costs $267.5 per sqft. Circle Bundle Sunset Tangerine costs $267.5 per sqft. Circle Bundle Sunset Taupe costs $267.5 per sqft. Circle Bundle Tan costs $267.5 per sqft. Circle Bundle Terracotta costs $267.5 per sqft. Circle Bundle Yellow costs $275.5 per sqft.","metadata":{"title":"Circle Bundle","source":"https://millpave.notprimitive.com/product/circle_bundle","contentLength":302}},{"pageContent":"Product Name: Circle Stepping Stone. The price of Circle Stepping Stone ranges from $228.5 to $445.5. Circle Stepping Stone description: Create a traditional feel to your garden with our Circle Stepping Stone Paver. As one of the most sought after styles of stone paving, it displays a beautiful range of colors which will brighten up any exterior to create an added sense of space! Using aggregates sourced from the St. Thomas River, Circle Stepping Stone promises an outdoor area filled with character and is a household favourite providing a wealth of design opportunities. Circle Stepping Stone specifications by variant group: \"Circle Stepping Stone\": Dimensions -- 11in x 11in x 2.375in, Weight per Unit -- 9.38, Area per Pallet -- 120, Units per Pallet -- 120, Pieces per sqft -- 1. Circle Stepping Stone is similar to Old World Cobble, Cobble Mix, and Colonial Classic. Circle Stepping Stone does not have 3D virtual samples at the moment. The following are the prices for all variants of Circle Stepping Stone: Circle Stepping Stone Ash costs $267.5 per sqft and $267.50 per unit. Circle Stepping Stone Charcoal costs $267.5 per sqft and $267.50 per unit. Circle Stepping Stone Charcoal Red costs $267.5 per sqft and $267.50 per unit. Circle Stepping Stone Green costs $445.5 per sqft and $445.50 per unit. Circle Stepping Stone Grey costs $228.5 per sqft and $228.50 per unit. Circle Stepping Stone Orange costs $267.5 per sqft and $267.50 per unit. Circle Stepping Stone Red costs $267.5 per sqft and $267.50 per unit. Circle Stepping Stone Red Yellow costs $267.5 per sqft and $267.50 per unit. Circle Stepping Stone Shale Brown costs $267.5 per sqft and $267.50 per unit. Circle Stepping Stone Slate costs $267.5 per sqft and $267.50 per unit. Circle Stepping Stone Spanish Brown costs $267.5 per sqft and $267.50 per unit. Circle Stepping Stone Sunset Clay costs $267.5 per sqft and $267.50 per unit. Circle Stepping Stone Sunset Tangerine costs $267.5 per sqft and $267.50 per unit. Circle Stepping Stone Sunset Taupe costs $267.5 per sqft and $267.50 per unit. Circle Stepping Stone Tan costs $267.5 per sqft and $267.50 per unit. Circle Stepping Stone Terracotta costs $267.5 per sqft and $267.50 per unit. Circle Stepping Stone Yellow costs $275.5 per sqft and $275.50 per unit.","metadata":{"title":"Circle Stepping Stone","source":"https://millpave.notprimitive.com/product/circle_stepping","contentLength":412}},{"pageContent":"Product Name: Cobble Mix. The price of Cobble Mix ranges from $219 to $396. Cobble Mix description: Create a traditional feel to your garden with our Cobble Mix Paver. As one of the most sought after styles of stone paving, it displays a beautiful range of colors which will brighten up any exterior to create an added sense of space! Using aggregates sourced from the St. Thomas River, Cobble Mix promises an outdoor area filled with character and is a household favourite providing a wealth of design opportunities. Cobble Mix specifications by variant group: \"Cobble Mix Double\": Dimensions -- 7in x 9.5in x 2.375in, Weight per Unit -- 11.28, Area per Pallet -- 119.28, Units per Pallet -- 266, Pieces per sqft -- 2.23. \"Cobble Mix Oblong\": Dimensions -- 4.75in x 7in x 2.375in, Weight per Unit -- 5.3, Area per Pallet -- 126.91, Units per Pallet -- 566, Pieces per sqft -- 4.46. \"Cobble Mix Two Part\": Dimensions -- 4.75in x 7in x 2.375in, Weight per Unit -- 3.53, Area per Pallet -- 130.97, Units per Pallet -- 850, Pieces per sqft -- 6.49. Cobble Mix is similar to Old World Cobble, Heritage Series, and Colonial Classic. 3D virtual samples of Cobble Mix are available. The following are the prices for all variants of Cobble Mix: Cobble Mix Double Ash costs $247 per sqft and $110.76 per unit. Cobble Mix Double Charcoal costs $247 per sqft and $110.76 per unit. Cobble Mix Double Charcoal Red costs $247 per sqft and $110.76 per unit. Cobble Mix Double Green costs $396 per sqft and $177.58 per unit. Cobble Mix Double Grey costs $219 per sqft and $98.21 per unit. Cobble Mix Double Orange costs $247 per sqft and $110.76 per unit. Cobble Mix Double Red costs $247 per sqft and $110.76 per unit. Cobble Mix Double Red Yellow costs $247 per sqft and $110.76 per unit. Cobble Mix Double Shale Brown costs $247 per sqft and $110.76 per unit. Cobble Mix Double Slate costs $247 per sqft and $110.76 per unit. Cobble Mix Double Spanish Brown costs $247 per sqft and $110.76 per unit. Cobble Mix Double Sunset Clay costs $247 per sqft and $110.76 per unit. Cobble Mix Double Sunset Tangerine costs $247 per sqft and $110.76 per unit. Cobble Mix Double Sunset Taupe costs $247 per sqft and $110.76 per unit. Cobble Mix Double Tan costs $247 per sqft and $110.76 per unit. Cobble Mix Double Terracotta costs $247 per sqft and $110.76 per unit. Cobble Mix Double Yellow costs $253 per sqft and $113.45 per unit. Cobble Mix Oblong Ash costs $247 per sqft and $55.38 per unit. Cobble Mix Oblong Charcoal costs $247 per sqft and $55.38 per unit. Cobble Mix Oblong Charcoal Red costs $247 per sqft and $55.38 per unit. Cobble Mix Oblong Green costs $396 per sqft and $88.79 per unit. Cobble Mix Oblong Grey costs $219 per sqft and $49.10 per unit. Cobble Mix Oblong Orange costs $247 per sqft and $55.38 per unit. Cobble Mix Oblong Red costs $247 per sqft and $55.38 per unit. Cobble Mix Oblong Red Yellow costs $247 per sqft and $55.38 per unit. Cobble Mix Oblong Shale Brown costs $247 per sqft and $55.38 per unit. Cobble Mix Oblong Slate costs $247 per sqft and $55.38 per unit. Cobble Mix Oblong Spanish Brown costs $247 per sqft and $55.38 per unit. Cobble Mix Oblong Sunset Clay costs $247 per sqft and $55.38 per unit. Cobble Mix Oblong Sunset Tangerine costs $247 per sqft and $55.38 per unit. Cobble Mix Oblong Sunset Taupe costs $247 per sqft and $55.38 per unit. Cobble Mix Oblong Tan costs $247 per sqft and $55.38 per unit. Cobble Mix Oblong Terracotta costs $247 per sqft and $55.38 per unit. Cobble Mix Oblong Yellow costs $253 per sqft and $56.73 per unit. Cobble Mix Two-Part Ash costs $247 per sqft and $38.06 per unit. Cobble Mix Two-Part Charcoal costs $247 per sqft and $38.06 per unit. Cobble Mix Two-Part Charcoal Red costs $247 per sqft and $38.06 per unit. Cobble Mix Two-Part Green costs $396 per sqft and $61.02 per unit. Cobble Mix Two-Part Grey costs $219 per sqft and $33.74 per unit. Cobble Mix Two-Part Orange costs $247 per sqft and $38.06 per unit. Cobble Mix Two-Part Red costs $247 per sqft and $38.06 per unit. Cobble Mix Two-Part Red Yellow costs $247 per sqft and $38.06 per unit. Cobble Mix Two-Part Shale Brown costs $247 per sqft and $38.06 per unit. Cobble Mix Two-Part Slate costs $247 per sqft and $38.06 per unit. Cobble Mix Two-Part Spanish Brown costs $247 per sqft and $38.06 per unit. Cobble Mix Two-Part Sunset Clay costs $247 per sqft and $38.06 per unit. Cobble Mix Two-Part Sunset Tangerine costs $247 per sqft and $38.06 per unit. Cobble Mix Two-Part Sunset Taupe costs $247 per sqft and $38.06 per unit. Cobble Mix Two-Part Tan costs $247 per sqft and $38.06 per unit. Cobble Mix Two-Part Terracotta costs $247 per sqft and $38.06 per unit. Cobble Mix Two-Part Yellow costs $253 per sqft and $38.98 per unit.","metadata":{"title":"Cobble Mix","source":"https://millpave.notprimitive.com/product/cobble_mix","contentLength":918}},{"pageContent":"Product Name: Colonial Classic. The price of Colonial Classic ranges from $203 to $363. Colonial Classic description: Create a traditional feel to your garden with our Colonial Classic Paver. As one of the most sought after styles of stone paving, it displays a beautiful range of colors which will brighten up any exterior to create an added sense of space! Using aggregates sourced from the St. Thomas River, Colonial Classic promises an outdoor area filled with character and is a household favourite providing a wealth of design opportunities. Colonial Classic specifications by variant group: \"Colonial Classic\": Dimensions -- 4in x 8in x 2.375in, Weight per Unit -- 5, Area per Pallet -- 128.75, Units per Pallet -- 600, Pieces per sqft -- 4.66. Colonial Classic is similar to Banjo, Thin Classic, and Heritage Series. 3D virtual samples of Colonial Classic are available. The following are the prices for all variants of Colonial Classic: Colonial Classic Ash costs $228 per sqft and $48.93 per unit. Colonial Classic Charcoal costs $228 per sqft and $48.93 per unit. Colonial Classic Charcoal Red costs $228 per sqft and $48.93 per unit. Colonial Classic Green costs $363 per sqft and $77.90 per unit. Colonial Classic Grey costs $203 per sqft and $43.56 per unit. Colonial Classic Orange costs $228 per sqft and $48.93 per unit. Colonial Classic Red costs $228 per sqft and $48.93 per unit. Colonial Classic Red Yellow costs $228 per sqft and $48.93 per unit. Colonial Classic Shale Brown costs $228 per sqft and $48.93 per unit. Colonial Classic Slate costs $228 per sqft and $48.93 per unit. Colonial Classic Spanish Brown costs $228 per sqft and $48.93 per unit. Colonial Classic Sunset Clay costs $228 per sqft and $48.93 per unit. Colonial Classic Sunset Tangerine costs $228 per sqft and $48.93 per unit. Colonial Classic Sunset Taupe costs $228 per sqft and $48.93 per unit. Colonial Classic Tan costs $228 per sqft and $48.93 per unit. Colonial Classic Terracotta costs $228 per sqft and $48.93 per unit. Colonial Classic Yellow costs $233 per sqft and $50.00 per unit.","metadata":{"title":"Colonial Classic","source":"https://millpave.notprimitive.com/product/colonial_classic","contentLength":362}},{"pageContent":"Product Name: Curb Wall. The price of Curb Wall ranges from $445.5 to $445.5. Curb Wall description: Integer a velit in sapien aliquam consectetur et vitae ligula. Integer ornare egestas enim a malesuada. Suspendisse arcu lectus, blandit nec gravida at, maximus ut lorem. Nulla malesuada vehicula neque at laoreet. Nullam efficitur mauris sit amet accumsan pulvinar. Curb Wall specifications by variant group: \"Curb Wall\": Dimensions -- 29.5in x 4in x 7in. Curb Wall is similar to Tropical Wave, Circle Stepping Stone, and Savannah. Curb Wall does not have 3D virtual samples at the moment. The following are the prices for all variants of Curb Wall: Curbwall Grey costs $445.5 per unit.","metadata":{"title":"Curb Wall","source":"https://millpave.notprimitive.com/product/curbwall","contentLength":114}},{"pageContent":"Product Name: DYNA Efflorescence Cleaner. The price of DYNA Efflorescence Cleaner ranges from $4000 to $4000. DYNA Efflorescence Cleaner description: Integer a velit in sapien aliquam consectetur et vitae ligula. Integer ornare egestas enim a malesuada. Suspendisse arcu lectus, blandit nec gravida at, maximus ut lorem. Nulla malesuada vehicula neque at laoreet. Nullam efficitur mauris sit amet accumsan pulvinar. DYNA Efflorescence Cleaner specifications by variant group: \"DYNA Efflorescence Cleaner One Gallon\": Coverage -- 100sqft Weight per unit -- 20. DYNA Efflorescence Cleaner is similar to DYNA Stone Soap, DYNA Gum Paint & Tar Stripper, and DYNA Oil-Based Sealant. DYNA Efflorescence Cleaner does not have 3D virtual samples at the moment. The following are the prices for all variants of DYNA Efflorescence Cleaner: DYNA Efflorescence Cleaner (1 gallon) costs $4000 per unit.","metadata":{"title":"DYNA Efflorescence Cleaner","source":"https://millpave.notprimitive.com/product/efflorescence_cleaner","contentLength":129}},{"pageContent":"Product Name: Grasscrete. The price of Grasscrete ranges from $228.5 to $305.5. Grasscrete description: Integer a velit in sapien aliquam consectetur et vitae ligula. Integer ornare egestas enim a malesuada. Suspendisse arcu lectus, blandit nec gravida at, maximus ut lorem. Nulla malesuada vehicula neque at laoreet. Nullam efficitur mauris sit amet accumsan pulvinar. Grasscrete specifications by variant group: \"Grasscrete Circle\": Dimensions -- 23.5in x 15.5in x 3.5in, Weight per Unit -- 19, Area per Pallet -- 106, Units per Pallet -- 40, Pieces per sqft -- 0.373. Grasscrete is similar to Tropical Wave, Circle Stepping Stone, and Savannah. Grasscrete does not have 3D virtual samples at the moment. The following are the prices for all variants of Grasscrete: Grasscrete Ash costs $305.5 per sqft and $819.03 per unit. Grasscrete Charcoal costs $305.5 per sqft and $819.03 per unit. Grasscrete Charcoal Red costs $305.5 per sqft and $819.03 per unit. Grasscrete Green costs $305.5 per sqft and $819.03 per unit. Grasscrete Grey costs $228.5 per sqft and $612.60 per unit. Grasscrete Orange costs $305.5 per sqft and $819.03 per unit. Grasscrete Red costs $305.5 per sqft and $819.03 per unit. Grasscrete Red Yellow costs $305.5 per sqft and $819.03 per unit. Grasscrete Shale Brown costs $305.5 per sqft and $819.03 per unit. Grasscrete Slate costs $305.5 per sqft and $819.03 per unit. Grasscrete Spanish Brown costs $305.5 per sqft and $819.03 per unit. Grasscrete Sunset Clay costs $305.5 per sqft and $819.03 per unit. Grasscrete Sunset Tangerine costs $305.5 per sqft and $819.03 per unit. Grasscrete Sunset Taupe costs $305.5 per sqft and $819.03 per unit. Grasscrete Tan costs $305.5 per sqft and $819.03 per unit. Grasscrete Terracotta costs $305.5 per sqft and $819.03 per unit. Grasscrete Yellow costs $305.5 per sqft and $819.03 per unit.","metadata":{"title":"Grasscrete","source":"https://millpave.notprimitive.com/product/grasscrete","contentLength":330}},{"pageContent":"Product Name: DYNA Gum Paint & Tar Stripper. The price of DYNA Gum Paint & Tar Stripper ranges from $2173.91 to $2173.91. DYNA Gum Paint & Tar Stripper description: Integer a velit in sapien aliquam consectetur et vitae ligula. Integer ornare egestas enim a malesuada. Suspendisse arcu lectus, blandit nec gravida at, maximus ut lorem. Nulla malesuada vehicula neque at laoreet. Nullam efficitur mauris sit amet accumsan pulvinar. DYNA Gum Paint & Tar Stripper specifications by variant group: \"DYNA Gum Paint & Tar Stripper One Quart\": Weight per unit -- 3. DYNA Gum Paint & Tar Stripper is similar to DYNA Efflorescence Cleaner, DYNA Stone Soap, and DYNA Oil-Based Sealant. DYNA Gum Paint & Tar Stripper does not have 3D virtual samples at the moment. The following are the prices for all variants of DYNA Gum Paint & Tar Stripper: DYNA Gum Paint and Tar Stripper (1 quart) costs $2173.91 per unit.","metadata":{"title":"DYNA Gum Paint & Tar Stripper","source":"https://millpave.notprimitive.com/product/gum_paint_tar","contentLength":147}},{"pageContent":"Product Name: Heritage Series. The price of Heritage Series ranges from $219 to $396. Heritage Series description: Create a traditional feel to your garden with our Heritage Series Paver. As one of the most sought after styles of stone paving, it displays a beautiful range of colors which will brighten up any exterior to create an added sense of space! Using aggregates sourced from the St. Thomas River, Heritage Series promises an outdoor area filled with character and is a household favourite providing a wealth of design opportunities. Heritage Series specifications by variant group: \"Heritage Series Regular\": Dimensions -- 6in x 9in x 2.375in, Weight per Unit -- 9.15, Area per Pallet -- 120.59, Units per Pallet -- 328, Pieces per sqft -- 2.72. \"Heritage Series Square\": Dimensions -- 6in x 6in x 2.375in, Weight per Unit -- 5.86, Area per Pallet -- 128, Units per Pallet -- 512, Pieces per sqft -- 4. \"Heritage Series Two Part\": Dimensions -- 6in x 9in x 2.375in, Weight per Unit -- 5.77, Area per Pallet -- 130, Units per Pallet -- 520, Pieces per sqft -- 4. Heritage Series is similar to Colonial Classic, Cobble Mix, and Old World Cobble. 3D virtual samples of Heritage Series are available. The following are the prices for all variants of Heritage Series: Heritage Regular Ash costs $247 per sqft and $90.81 per unit. Heritage Regular Charcoal costs $247 per sqft and $90.81 per unit. Heritage Regular Charcoal Red costs $247 per sqft and $90.81 per unit. Heritage Regular Green costs $396 per sqft and $145.59 per unit. Heritage Regular Grey costs $219 per sqft and $80.51 per unit. Heritage Regular Orange costs $247 per sqft and $90.81 per unit. Heritage Regular Red costs $247 per sqft and $90.81 per unit. Heritage Regular Red Yellow costs $247 per sqft and $90.81 per unit. Heritage Regular Shale Brown costs $247 per sqft and $90.81 per unit. Heritage Regular Slate costs $247 per sqft and $90.81 per unit. Heritage Regular Spanish Brown costs $247 per sqft and $90.81 per unit. Heritage Regular Sunset Clay costs $247 per sqft and $90.81 per unit. Heritage Regular Sunset Tangerine costs $247 per sqft and $90.81 per unit. Heritage Regular Sunset Taupe costs $247 per sqft and $90.81 per unit. Heritage Regular Tan costs $247 per sqft and $90.81 per unit. Heritage Regular Terracotta costs $247 per sqft and $90.81 per unit. Heritage Regular Yellow costs $253 per sqft and $93.01 per unit. Heritage Square Ash costs $247 per sqft and $61.75 per unit. Heritage Square Charcoal costs $247 per sqft and $61.75 per unit. Heritage Square Charcoal Red costs $247 per sqft and $61.75 per unit. Heritage Square Green costs $396 per sqft and $99.00 per unit. Heritage Square Grey costs $219 per sqft and $54.75 per unit. Heritage Square Orange costs $247 per sqft and $61.75 per unit. Heritage Square Red costs $247 per sqft and $61.75 per unit. Heritage Square Red Yellow costs $247 per sqft and $61.75 per unit. Heritage Square Shale Brown costs $247 per sqft and $61.75 per unit. Heritage Square Slate costs $247 per sqft and $61.75 per unit. Heritage Square Spanish Brown costs $247 per sqft and $61.75 per unit. Heritage Square Sunset Clay costs $247 per sqft and $61.75 per unit. Heritage Square Sunset Tangerine costs $247 per sqft and $61.75 per unit. Heritage Square Sunset Taupe costs $247 per sqft and $61.75 per unit. Heritage Square Tan costs $247 per sqft and $61.75 per unit. Heritage Square Terracotta costs $247 per sqft and $61.75 per unit. Heritage Square Yellow costs $253 per sqft and $63.25 per unit. Heritage Two-Part Ash costs $247 per sqft and $61.75 per unit. Heritage Two-Part Charcoal costs $247 per sqft and $61.75 per unit. Heritage Two-Part Charcoal Red costs $247 per sqft and $61.75 per unit. Heritage Two-Part Green costs $396 per sqft and $99.00 per unit. Heritage Two-Part Grey costs $219 per sqft and $54.75 per unit. Heritage Two-Part Orange costs $247 per sqft and $61.75 per unit. Heritage Two-Part Red costs $247 per sqft and $61.75 per unit. Heritage Two-Part Red Yellow costs $247 per sqft and $61.75 per unit. Heritage Two-Part Shale Brown costs $247 per sqft and $61.75 per unit. Heritage Two-Part Slate costs $247 per sqft and $61.75 per unit. Heritage Two-Part Spanish Brown costs $247 per sqft and $61.75 per unit. Heritage Two-Part Sunset Clay costs $247 per sqft and $61.75 per unit. Heritage Two-Part Sunset Tangerine costs $247 per sqft and $61.75 per unit. Heritage Two-Part Sunset Taupe costs $247 per sqft and $61.75 per unit. Heritage Two-Part Tan costs $247 per sqft and $61.75 per unit. Heritage Two-Part Terracotta costs $247 per sqft and $61.75 per unit. Heritage Two-Part Yellow costs $253 per sqft and $63.25 per unit.","metadata":{"title":"Heritage Series","source":"https://millpave.notprimitive.com/product/heritage","contentLength":860}},{"pageContent":"Product Name: DYNA Oil-Based Sealant. The price of DYNA Oil-Based Sealant ranges from $5913.04 to $25826.09. DYNA Oil-Based Sealant description: Integer a velit in sapien aliquam consectetur et vitae ligula. Integer ornare egestas enim a malesuada. Suspendisse arcu lectus, blandit nec gravida at, maximus ut lorem. Nulla malesuada vehicula neque at laoreet. Nullam efficitur mauris sit amet accumsan pulvinar. DYNA Oil-Based Sealant specifications by variant group: \"DYNA Oil-Based Sealant Five Gallon\": Coverage -- 500sqft Weight per unit -- 25. \"DYNA Oil-Based Sealant One Gallon\": Coverage -- 100sqft Weight per unit -- 4. DYNA Oil-Based Sealant is similar to DYNA Water-Based Sealant, DYNA Efflorescence Cleaner, and DYNA Polymeric Sand. DYNA Oil-Based Sealant does not have 3D virtual samples at the moment. The following are the prices for all variants of DYNA Oil-Based Sealant: DYNA Oil-Based Sealant (5 gallon) costs $25826.09 per unit. DYNA Oil-Based Sealant (1 gallon) costs $5913.04 per unit.","metadata":{"title":"DYNA Oil-Based Sealant","source":"https://millpave.notprimitive.com/product/oil_sealant","contentLength":162}},{"pageContent":"Product Name: Old World Cobble. The price of Old World Cobble ranges from $203 to $363. Old World Cobble description: Create a traditional feel to your garden with our Old World Cobble Paver. As one of the most sought after styles of stone paving, it displays a beautiful range of colors which will brighten up any exterior to create an added sense of space! Using aggregates sourced from the St. Thomas River, Old World Cobble promises an outdoor area filled with character and is a household favourite providing a wealth of design opportunities. Old World Cobble specifications by variant group: \"Old World Cobble\": Dimensions -- 5.5in x 9in x 2.375in, Weight per Unit -- 3.75, Area per Pallet -- 125.39, Units per Pallet -- 800, Pieces per sqft -- 6.38. Old World Cobble is similar to Cobble Mix, Tropical Wave, and Colonial Classic. 3D virtual samples of Old World Cobble are available. The following are the prices for all variants of Old World Cobble: Old World Cobble Ash costs $228 per sqft and $35.74 per unit. Old World Cobble Charcoal costs $228 per sqft and $35.74 per unit. Old World Cobble Charcoal Red costs $228 per sqft and $35.74 per unit. Old World Cobble Green costs $363 per sqft and $56.90 per unit. Old World Cobble Grey costs $203 per sqft and $31.82 per unit. Old World Cobble Orange costs $228 per sqft and $35.74 per unit. Old World Cobble Red costs $228 per sqft and $35.74 per unit. Old World Cobble Red Yellow costs $228 per sqft and $35.74 per unit. Old World Cobble Shale Brown costs $228 per sqft and $35.74 per unit. Old World Cobble Slate costs $228 per sqft and $35.74 per unit. Old World Cobble Spanish Brown costs $228 per sqft and $35.74 per unit. Old World Cobble Sunset Clay costs $228 per sqft and $35.74 per unit. Old World Cobble Sunset Tangerine costs $228 per sqft and $35.74 per unit. Old World Cobble Sunset Taupe costs $228 per sqft and $35.74 per unit. Old World Cobble Tan costs $228 per sqft and $35.74 per unit. Old World Cobble Terracotta costs $228 per sqft and $35.74 per unit. Old World Cobble Yellow costs $233 per sqft and $36.52 per unit.","metadata":{"title":"Old World Cobble","source":"https://millpave.notprimitive.com/product/owc","contentLength":392}},{"pageContent":"Product Name: DYNA Polymeric Sand. The price of DYNA Polymeric Sand ranges from $2695.65 to $2695.65. DYNA Polymeric Sand description: Integer a velit in sapien aliquam consectetur et vitae ligula. Integer ornare egestas enim a malesuada. Suspendisse arcu lectus, blandit nec gravida at, maximus ut lorem. Nulla malesuada vehicula neque at laoreet. Nullam efficitur mauris sit amet accumsan pulvinar. DYNA Polymeric Sand specifications by variant group: \"DYNA Polymeric Sand Fifty Pound\": Coverage -- 100sqft Weight per unit -- 50. DYNA Polymeric Sand is similar to DYNA Oil-Based Sealant, DYNA Water-Based Sealant, and DYNA Efflorescence Cleaner. DYNA Polymeric Sand does not have 3D virtual samples at the moment. The following are the prices for all variants of DYNA Polymeric Sand: DYNA Polymeric Sand (50 pound) costs $2695.65 per bag.","metadata":{"title":"DYNA Polymeric Sand","source":"https://millpave.notprimitive.com/product/polymeric_sand","contentLength":131}},{"pageContent":"Product Name: Savannah. The price of Savannah ranges from $219 to $305.5. Savannah description: Integer a velit in sapien aliquam consectetur et vitae ligula. Integer ornare egestas enim a malesuada. Suspendisse arcu lectus, blandit nec gravida at, maximus ut lorem. Nulla malesuada vehicula neque at laoreet. Nullam efficitur mauris sit amet accumsan pulvinar. Savannah specifications by variant group: \"Savannah 16x16\": Dimensions -- 16in x 16in x 3in, Weight per Unit -- 28, Area per Pallet -- 104.88, Units per Pallet -- 59, Pieces per sqft -- 0.5625. \"Savannah 16x24\": Dimensions -- 16in x 24in x 3in, Weight per Unit -- 36, Area per Pallet -- 104, Units per Pallet -- 39, Pieces per sqft -- 0.375. \"Savannah 16x8\": Dimensions -- 8in x 16in x 3in, Weight per Unit -- 20, Area per Pallet -- 104.4, Units per Pallet -- 116, Pieces per sqft -- 0.9. \"Savannah 24x24\": Dimensions -- 24in x 24in x 3in, Weight per Unit -- 42, Area per Pallet -- 104, Units per Pallet -- 26, Pieces per sqft -- 0.25. Savannah is similar to Heritage Series, Circle Stepping Stone, and Grasscrete. Savannah does not have 3D virtual samples at the moment. The following are the prices for all variants of Savannah: Savannah 16 x 16 Exposed Ash costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Exposed Charcoal costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Exposed Charcoal Red costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Exposed Green costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Exposed Grey costs $228.5 per sqft and $406.22 per unit. Savannah 16 x 16 Exposed Orange costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Exposed Red costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Exposed Red Yellow costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Exposed Shale Brown costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Exposed Slate costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Exposed Spanish Brown costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Exposed Sunset Clay costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Exposed Sunset Tangerine costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Exposed Sunset Taupe costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Exposed Tan costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Exposed Terracotta costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Exposed Yellow costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Ash costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Charcoal costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Charcoal Red costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Green costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Grey costs $228.5 per sqft and $406.22 per unit. Savannah 16 x 16 Orange costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Red costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Red Yellow costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Shale Brown costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Slate costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Spanish Brown costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Sunset Clay costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Sunset Tangerine costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Sunset Taupe costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Tan costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Terracotta costs $305.5 per sqft and $543.11 per unit. Savannah 16 x 16 Yellow costs $305.5 per sqft and $543.11 per unit. Savannah 24 x 16 Regular Ash costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Regular Charcoal costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Regular Charcoal Red costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Regular Green costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Regular Grey costs $228.5 per sqft and $609.33 per unit. Savannah 24 x 16 Regular Orange costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Regular Red costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Regular Red Yellow costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Regular Shale Brown costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Regular Slate costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Regular Spanish Brown costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Regular Sunset Clay costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Regular Sunset Tangerine costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Regular Sunset Taupe costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Regular Tan costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Regular Terracotta costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Regular Yellow costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Exposed Ash costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Exposed Charcoal costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Exposed Charcoal Red costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Exposed Green costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Exposed Grey costs $228.5 per sqft and $609.33 per unit. Savannah 24 x 16 Exposed Orange costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Exposed Red costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Exposed Red Yellow costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Exposed Shale Brown costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Exposed Slate costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Exposed Spanish Brown costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Exposed Sunset Clay costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Exposed Sunset Tangerine costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Exposed Sunset Taupe costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Exposed Tan costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Exposed Terracotta costs $305.5 per sqft and $814.67 per unit. Savannah 24 x 16 Exposed Yellow costs $305.5 per sqft and $814.67 per unit. Savannah 16 x 8 Exposed Ash costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Exposed Charcoal costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Exposed Charcoal Red costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Exposed Green costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Exposed Grey costs $219 per sqft and $243.33 per unit. Savannah 16 x 8 Exposed Orange costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Exposed Red costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Exposed Red Yellow costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Exposed Shale Brown costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Exposed Slate costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Exposed Spanish Brown costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Exposed Sunset Clay costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Exposed Sunset Tangerine costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Exposed Sunset Taupe costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Exposed Tan costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Exposed Terracotta costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Exposed Yellow costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Regular Ash costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Regular Charcoal costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Regular Charcoal Red costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Regular Green costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Regular Grey costs $219 per sqft and $243.33 per unit. Savannah 16 x 8 Regular Orange costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Regular Red costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Regular Red Yellow costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Regular Shale Brown costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Regular Slate costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Regular Spanish Brown costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Regular Sunset Clay costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Regular Sunset Tangerine costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Regular Sunset Taupe costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Regular Tan costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Regular Terracotta costs $275.5 per sqft and $306.11 per unit. Savannah 16 x 8 Regular Yellow costs $275.5 per sqft and $306.11 per unit. Savannah 24 x 24 Exposed Ash costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Exposed Charcoal costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Exposed Charcoal Red costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Exposed Green costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Exposed Grey costs $228.5 per sqft and $914.00 per unit. Savannah 24 x 24 Exposed Orange costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Exposed Red costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Exposed Red Yellow costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Exposed Shale Brown costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Exposed Slate costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Exposed Spanish Brown costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Exposed Sunset Clay costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Exposed Sunset Tangerine costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Exposed Sunset Taupe costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Exposed Tan costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Exposed Terracotta costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Exposed Yellow costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Regular Ash costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Regular Charcoal costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Regular Charcoal Red costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Regular Green costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Regular Grey costs $228.5 per sqft and $914.00 per unit. Savannah 24 x 24 Regular Orange costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Regular Red costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Regular Red Yellow costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Regular Shale Brown costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Regular Slate costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Regular Spanish Brown costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Regular Sunset Clay costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Regular Sunset Tangerine costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Regular Sunset Taupe costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Regular Tan costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Regular Terracotta costs $305.5 per sqft and $1,222.00 per unit. Savannah 24 x 24 Regular Yellow costs $305.5 per sqft and $1,222.00 per unit.","metadata":{"title":"Savannah","source":"https://millpave.notprimitive.com/product/savannah","contentLength":2437}},{"pageContent":"Product Name: DYNA Stone Soap. The price of DYNA Stone Soap ranges from $1739.13 to $1739.13. DYNA Stone Soap description: Integer a velit in sapien aliquam consectetur et vitae ligula. Integer ornare egestas enim a malesuada. Suspendisse arcu lectus, blandit nec gravida at, maximus ut lorem. Nulla malesuada vehicula neque at laoreet. Nullam efficitur mauris sit amet accumsan pulvinar. DYNA Stone Soap specifications by variant group: \"DYNA Stone Soap One Quart\": Coverage -- 25sqft Weight per unit -- 6. DYNA Stone Soap is similar to DYNA Efflorescence Cleaner, DYNA Gum Paint & Tar Stripper, and DYNA Oil-Based Sealant. DYNA Stone Soap does not have 3D virtual samples at the moment. The following are the prices for all variants of DYNA Stone Soap: DYNA Stone Soap (1 quart) costs $1739.13 per unit.","metadata":{"title":"DYNA Stone Soap","source":"https://millpave.notprimitive.com/product/stone_soap","contentLength":132}},{"pageContent":"Product Name: Thin Classic. The price of Thin Classic ranges from $188 to $333. Thin Classic description: Create a traditional feel to your garden with our Thin Classic Paver. As one of the most sought after styles of stone paving, it displays a beautiful range of colors which will brighten up any exterior to create an added sense of space! Using aggregates sourced from the St. Thomas River, Thin Classic promises an outdoor area filled with character and is a household favourite providing a wealth of design opportunities. Thin Classic specifications by variant group: \"Thin Classic\": Dimensions -- 4in x 8in x 1.375in, Weight per Unit -- 4.16, Area per Pallet -- 154.5, Units per Pallet -- 720, Pieces per sqft -- 4.66. Thin Classic is similar to Colonial Classic, Banjo, and Circle Bundle. 3D virtual samples of Thin Classic are available. The following are the prices for all variants of Thin Classic: Thin Classic Ash costs $210 per sqft and $45.06 per unit. Thin Classic Charcoal costs $210 per sqft and $45.06 per unit. Thin Classic Charcoal Red costs $210 per sqft and $45.06 per unit. Thin Classic Green costs $333 per sqft and $71.46 per unit. Thin Classic Grey costs $188 per sqft and $40.34 per unit. Thin Classic Orange costs $210 per sqft and $45.06 per unit. Thin Classic Red costs $210 per sqft and $45.06 per unit. Thin Classic Red Yellow costs $210 per sqft and $45.06 per unit. Thin Classic Shale Brown costs $210 per sqft and $45.06 per unit. Thin Classic Slate costs $210 per sqft and $45.06 per unit. Thin Classic Spanish Brown costs $210 per sqft and $45.06 per unit. Thin Classic Sunset Clay costs $210 per sqft and $45.06 per unit. Thin Classic Sunset Tangerine costs $210 per sqft and $45.06 per unit. Thin Classic Sunset Taupe costs $210 per sqft and $45.06 per unit. Thin Classic Tan costs $210 per sqft and $45.06 per unit. Thin Classic Terracotta costs $210 per sqft and $45.06 per unit. Thin Classic Yellow costs $215 per sqft and $46.14 per unit.","metadata":{"title":"Thin Classic","source":"https://millpave.notprimitive.com/product/thin_classic","contentLength":363}},{"pageContent":"Product Name: Tropical Wave. The price of Tropical Wave ranges from $228.5 to $445.5. Tropical Wave description: Create a traditional feel to your garden with our Tropical Wave Paver. As one of the most sought after styles of stone paving, it displays a beautiful range of colors which will brighten up any exterior to create an added sense of space! Using aggregates sourced from the St. Thomas River, Tropical Wave promises an outdoor area filled with character and is a household favourite providing a wealth of design opportunities. Tropical Wave specifications by variant group: \"Tropical Wave\": Dimensions -- 4.75in x 9.5in x 3in, Weight per Unit -- 9.38, Area per Pallet -- 102.89, Units per Pallet -- 320, Pieces per sqft -- 3.11. Tropical Wave is similar to Old World Cobble, Cobble Mix, and Colonial Classic. 3D virtual samples of Tropical Wave are available. The following are the prices for all variants of Tropical Wave: Tropical Wave Ash costs $267.5 per sqft and $86.01 per unit. Tropical Wave Charcoal costs $267.5 per sqft and $86.01 per unit. Tropical Wave Charcoal Red costs $267.5 per sqft and $86.01 per unit. Tropical Wave Green costs $445.5 per sqft and $143.25 per unit. Tropical Wave Grey costs $228.5 per sqft and $73.47 per unit. Tropical Wave Orange costs $267.5 per sqft and $86.01 per unit. Tropical Wave Red costs $267.5 per sqft and $86.01 per unit. Tropical Wave Red Yellow costs $267.5 per sqft and $86.01 per unit. Tropical Wave Shale Brown costs $267.5 per sqft and $86.01 per unit. Tropical Wave Slate costs $267.5 per sqft and $86.01 per unit. Tropical Wave Spanish Brown costs $267.5 per sqft and $86.01 per unit. Tropical Wave Sunset Clay costs $267.5 per sqft and $86.01 per unit. Tropical Wave Sunset Tangerine costs $267.5 per sqft and $86.01 per unit. Tropical Wave Sunset Taupe costs $267.5 per sqft and $86.01 per unit. Tropical Wave Tan costs $267.5 per sqft and $86.01 per unit. Tropical Wave Terracotta costs $267.5 per sqft and $86.01 per unit. Tropical Wave Yellow costs $275.5 per sqft and $88.59 per unit.","metadata":{"title":"Tropical Wave","source":"https://millpave.notprimitive.com/product/tropical_wave","contentLength":385}},{"pageContent":"Product Name: DYNA Water-Based Sealant. The price of DYNA Water-Based Sealant ranges from $5913.04 to $25826.09. DYNA Water-Based Sealant description: Integer a velit in sapien aliquam consectetur et vitae ligula. Integer ornare egestas enim a malesuada. Suspendisse arcu lectus, blandit nec gravida at, maximus ut lorem. Nulla malesuada vehicula neque at laoreet. Nullam efficitur mauris sit amet accumsan pulvinar. DYNA Water-Based Sealant specifications by variant group: \"DYNA Water-Based Sealant Five Gallon\": Coverage -- 500sqft Weight per unit -- 25. \"DYNA Water-Based Sealant One Gallon\": Coverage -- 100sqft Weight per unit -- 4. DYNA Water-Based Sealant is similar to DYNA Oil-Based Sealant, DYNA Efflorescence Cleaner, and DYNA Polymeric Sand. DYNA Water-Based Sealant does not have 3D virtual samples at the moment. The following are the prices for all variants of DYNA Water-Based Sealant: DYNA Water-Based Sealant (5 Gallon) costs $25826.09 per unit. DYNA Water-Based Sealant (1 Gallon) costs $5913.04 per unit.","metadata":{"title":"DYNA Water-Based Sealant","source":"https://millpave.notprimitive.com/product/water_sealant","contentLength":162}},{"pageContent":"Millennium sells products in the following categories: Concrete pavers -- Banjo, Circle Bundle, Circle Stepping Stone, Cobble Mix, Colonial Classic, Heritage Series, Old World Cobble, Thin Classic, and Tropical Wave.Maintenance products for concrete -- DYNA Efflorescence Cleaner, DYNA Gum Paint & Tar Stripper, DYNA Oil-Based Sealant, DYNA Polymeric Sand, DYNA Stone Soap, and DYNA Water-Based Sealant. Slabs and Blocks -- Curb Wall, Grasscrete, and Savannah.","metadata":{"title":"","source":"https://millpave.notprimitive.com/products/all","contentLength":64}}]